import { Link } from "react-router-dom";
import style from "./About.module.scss";

const About = () => {
  return (
    <div className={style.about}>
      <h1 className={style.mainText} id={style.title}>قواعد اللعبه</h1>
      <iframe width="100%" height="315" src="https://www.youtube.com/embed/2YIK3mao5io?si=bTh9gpWMLXqvgFvX" title="YouTube video player" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" ></iframe>
      <h3  className={style.mainText}>جاهزين للتحدي؟ 😎</h3>
      <div>
        <h3>شرح اللعب 👇 </h3>
        <p>
          كل لاعب بيبدأ ومعه 4 كروت، وباقي الكروت بتنحط مقلوبة على الطاولة.
          مسموح لكل لاعب يشوف كرتين بس من ورقه، وإذا حاول يشوف كرت زيادة أو يغير
          ترتيب الكروت، بنقوله “يلبس”! 😅
        </p>
      </div>

      <div>
        <h3>الهدف من اللعبة:</h3>
        <p>
          إنه يكون معك أقل عدد من النقاط عشان تفوز بالجولة. اللعب بيستمر كذا
          جولة، وبالنهاية اللاعب اللي بيجمع أكتر عدد من النقاط هو اللي بيخسر
          وبيصير “سكرو اللعبة”.
        </p>
      </div>

      <div>
        <h3>الكروت الخاصة:</h3>
        <ul>
          <li>الكوماندز 7 و 8: بيخلوك تشوف كرت إضافي من الورق.</li>
          <li>الكوماندز 9 و 10: بيخلوك تشوف كرت عند لاعب ثاني.</li>
          <li>
            كرت “الخد وهات”: تبدل كرت عشوائي مع لاعب ثاني بدون ما تشوف. إذا
            انكشفت وأنت تبدل، بتلبس الكرتين.
          </li>
          <li>
            كرت “كعب داير”: بيخليك تشوف كرت عند كل اللاعبين، بما فيهم نفسك.
          </li>
          <li>كرت “البصرة”: تتخلص من كرت باختيارك.</li>
        </ul>
      </div>

      <div>
        <h3>ملاحظات:</h3>
        <ul>
          <li>
            عشان تفعل أي كرت من الكوماندز، لازم يكون الكرت مسحوب من الورق اللي
            بالنص. إذا كان معك كرت كوماند من البداية، لازم تتخلص منه لأنه قيمته
            10 نقاط.
          </li>
          <li>الكرت الغير عادي (+20): لازم تتخلص منه بأسرع وقت.</li>
          <li>كرت (-1): ممتاز، احتفظ فيه.</li>
          <li>كرت “سكرو الأحمر”: قيمته 20 نقطة.</li>
          <li>كرت “سكرو درايفر”: قيمته 0</li>
        </ul>
      </div>

      <div>
        <h3>طريقة اللعب 💡🕹</h3>
        <ul>
          <li>قبل ما يبدأ أي لاعب يلعب، مسموح تبص بسرعة على كروتك.</li>
          <li>أول كرت من كومة الورق بينحط مكشوف عالطاولة.</li>
          <li>
            كل لاعب بيلعب دوره بالتوالي، يسحب كرت جديد أو يبدل كرت عمياني من
            الكروت المقلوبة قدامه.
          </li>
          <li>إذا مش حابب تسحب، بدل كرت من الأرض بسرعة بدون ما تشوف.</li>
          <li>
            إذا لاعبين من الأربعة خلصوا ورقهم، باقي اللاعبين بيكشفوا ورقهم ونشوف
            مين معه أقل عدد نقاط، وبيكون هو الفايز بالجولة.
          </li>
        </ul>
      </div>

      <div className={style.linkContainer}>
        <Link to={"/"} className="btn btn-primary">اشتري الان</Link>
      </div>
    </div>
  );
};

export default About;
